---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures
source: html/d8c5e25d-b949-e3c6-40f2-2daede99828b.htm
---
# BuiltInFailures.WallJoinRoofFailures Properties

Highlighted wall is set to be "From roof", however there is no roof below it that can be used.